Repository: aivus/contexts
Catalog: i18n/*.xliff
Languages: ru

source: (I )start timing now
ru: (я )засекаю время

# i-set-basic-authentication
source: (I )set basic authentication with :user and :password
ru: (я )устанавливаю Basic-аутентификацию с :user и :password

source: (I )am on url composed by:
ru: (я )на адресе из:

# i-click-on-the-nth-element
source: (I )click on the :index :element element
ru: (я )кликаю на :index элемент :element

# i-follow-the-nth-link
source: (I )follow the :index :link link
ru: (я )кликаю по :index ссылке :link

# i-press-the-nth-button
source: (I )press the :index :button button
ru: (я )нажимаю на :index кнопку :button

# i-fill-in-with-the-current-date
source: (I )fill in :field with the current date
ru: (я )заполняю поле :field текущей датой

# i-fill-in-with-the-current-date-and-modifier
source: (I )fill in :field with the current date and modifier :modifier
ru: (я )заполняю поле :field текущей датой с поправкой :modifier

# i-hover
source: (I )hover :element
ru: (я )навожу на :element

# i-save-the-value-of-in-the-parameters
source: (I )save the value of :field in the :parameter parameter
ru: (я )сохраняю значение поля :field в параметре :parameter

# i-wait-seconds-until-i-see
source: (I )wait :count second(s) until I see :text
ru: (я )жду :count секунд(у)(ы) пока не увижу :text

# i-should-not-see-within-second
source: (I )should not see :text within :count second(s)
ru: (я )не должен видеть :text в течение :count секунд(ы)

# i-wait-until-i-see
source: (I )wait until I see :text
ru: (я )жду пока не увижу :text

# i-wait-seconds-until-i-see-in-the-element
source: (I )wait :count second(s) until I see :text in the :element element
ru: (я )жду :count секунд(у)(ы) пока не увижу :text в элементе :element

# i-wait-second
source: (I )wait :count second(s)
ru: (я )жду :count секунд(у)(ы)

# i-wait-until-i-see-in-the-element
source: (I )wait until I see :text in the :element element
ru: (я )жду пока не увижу :text в элементе :element

# i-wait-for-element
source: (I )wait for :element element
ru: (я )жду элемент :element

# i-wait-seconds-for-element
source: (I )wait :count second(s) for :element element
ru: (я )жду :count секунд(у)(ы) элемент :element

# i-should-see-n-in-the-nth
source: /^(?:|I )should see (?P<count>\d+) "(?P<element>[^"]*)" in the (?P<index>\d+)(?:st|nd|rd|th) "(?P<parent>[^"]*)"$/
ru: /^(?:|я )должен видеть (?P<count>\d+) "(?P<element>[^"]*)" в (?P<index>\d+)(?:ом|ем|м) "(?P<parent>[^"]*)"$/

# i-should-see-less-than-n-in-the-nth
source: (I )should see less than :count :element in the :index :parent
ru: (я )должен видеть менее :count :element в :index :parent

# i-should-see-more-than-n-in-the-nth
source: (I )should see more than :count :element in the :index :parent
ru: (я )должен видеть более :count :element в :index :parent

# the-element-should-be-enabled
source: the element :element should be enabled
ru: элемент :element должен быть доступен

# the-element-shouls-be-disabled
source: the element :element should be disabled
ru: элемент :element должен быть недоступен

# the-select-box-should-contain
source: the :select select box should contain :option
ru: выпадающий список :select должен содержать :option

# the-select-box-should-not-contain
source: the :select select box should not contain :option
ru: выпадающий список :select не должен содержать :option

# the-element-shouls-be-visible
source: the :element element should be visible
ru: элемент :element должен быть видимым

# the-element-should-not-be-visible
source: the :element element should not be visible
ru: элемент :element не должен быть видимым

# i-switch-to-iframe
source: (I )switch to iframe :name
ru: (я )переключаюсь на iframe :name

# i-switch-to-frame
source: (I )switch to frame :name
ru: (я )переключаюсь на фрейм :name

source: (I )switch to main frame
ru: (я )я переключаюсь на главный фрейм

# the-total-elapsed-time-should-be-than-seconds
source: (the )total elapsed time should be :comparison than :expected seconds
ru: общее время должно быть :comparison чем :expected секунд(ы)(у)

# the-total-elapsed-time-should-be-to-seconds
source: (the )total elapsed time should be :comparison to :expected seconds
ru: общее время должно быть :comparison :expected секунд(ы)(у)

# i-put-the-file-into-field
source: (I )put the file :file into :field
ru: (я )загружаю файл :file в поле :field

# i-execute
source: (I )execute :command
ru: (я )выполняю :command

# i-execute-from-project-root
source: (I )execute :command from project root
ru: (я )выполняю :command и корня проекта

source: command should succeed
ru: команда должна выполниться успешно

source: command should fail
ru: команда должна выполниться неуспешно

# command-should-last-lett-than
source: command should last less than :seconds seconds
ru: команда должна выполняться менее чем :seconds секунд(ы)(у)

# command-should-last-more-than
source: command should last more than :seconds seconds
ru: команда должна выполняться более чем :seconds секунд(ы)(у)

# i-create-the-file-contening
source: (I )create the file :filename containing:
ru: (я )создаю файл :filename с содержимым:

# output-should-contain
source: output should contain :text
ru: вывод должен содержать :text

# output-should-not-contain
source: output should not contain :text
ru: вывод не должен содержать :text

source: output should be:
ru: вывод должен быть:

source: output should not be:
ru: вывод не должен быть:

# print-the-content-of-file
source: print the content of :filename file
ru: выведи содержимое файла :filename

source: the response should be in JSON
ru: ответ должен быть в JSON

source: the response should not be in JSON
ru: ответ не должен быть в JSON

# the-json-node-should-be-equal-to
source: the JSON node :node should be equal to :expected
ru: узел JSON :node должен быть равен :expected

# the-json-node-should-match
source: the JSON node :node should match :pattern
ru: узел JSON :node должен соответствовать :pattern

source: the JSON nodes should be equal to:
ru: узлы JSON должны быть равны:

# the-json-node-should-be-null
source: the JSON node :node should be null
ru: узел JSON :node должен быть null

# the-json-node-should-not-be-null
source: the JSON node :node should not be null
ru: узел JSON :node не должен быть null

# the-json-node-should-be-true
source: the JSON node :node should be true
ru: узел JSON :node должен быть истиной

# the-json-node-should-be-false
source: the JSON node :node should be false
ru: узел JSON :node должен быть ложью

# the-json-node-should-be-equal-to-the-string
source: the JSON node :node should be equal to the string :expected
ru: узел JSON :node должен быть равен строке :expected

# the-json-node-should-be-equal-to-the-number
source: the JSON node :node should be equal to the number :number
ru: узел JSON :node должен быть равен числу :number

# the-json-node-should-have-n-elements
source: the JSON node :node should have :count element(s)
ru: узел JSON :node должен содержать :count элемент(а)(ов)

# the-json-node-should-contain-text
source: the JSON node :node should contain :text
ru: узел JSON :node должен содержать :text

source: the JSON nodes should contain:
ru: узлы JSON должны содержать:

# the-json-node-should-not-contain
source: the JSON node :node should not contain :text
ru: узел JSON :node не должен содержать :text

source: the JSON nodes should not contain:
ru: узлы JSON не должны содержать:

# the-json-node-should-exist
source: the JSON node :name should exist
ru: узел JSON :name должен существовать

# the-json-node-should-not-exists
source: the JSON node :name should not exist
ru: узел JSON :name не должен существовать

source: the JSON should be valid according to this schema:
ru: JSON должен соответствовать следующей схеме:

source: the JSON should be invalid according to this schema:
ru: JSON не должен соответствовать следующей схеме:

# the-json-should-be-valid-according-to-the-schema
source: the JSON should be valid according to the schema :filename
ru: JSON должен соответствовать схеме :filename

# the-json-should-be-invalid-according-to-the-schema
source: the JSON should be invalid according to the schema :filename
ru: JSON не должен соответствовать схеме :filename

# the-json-should-be-eqal-to
source: the JSON should be equal to:
ru: JSON должен быть равен:

source: print last JSON response
ru: выведи последний JSON ответ

# i-send-a-request-to
source: (I )send a :method request to :url
ru: я отправляю :method запрос на :url

# i-send-a-request-on-with-parameters
source: (I )send a :method request to :url with parameters:
ru: я отправляю :method запрос на :url с параметрами:

# i-send-a-request-on-with-body
source: (I )send a :method request to :url with body:
ru: я отправляю :method запрос на :url с телом:

source: the response should be equal to:
ru: ответ должен быть

source: the response should be empty
ru: ответ должен быть пустым

# the-header-should-be-equal-to
source: the header :name should be equal to :value
ru: заголовок :name должен быть равен :value

# the-header-should-not-be-equal-to
source: the header :name should not be equal to :value
ru: заголовок :name не должен быть равен :value

# i-add-header-equal-to
source: (I )add :name header equal to :value
ru: я добавляю заголовок :name со значением :value

# the-header-should-be-contains
source: the header :name should contain :value
ru: заголовок :name должен содержать :value

# the-header-should-not-contain
source: the header :name should not contain :value
ru: заголовок :name не должен содержать :value

# the-header-should-not-exist
source: the header :name should not exist
ru: заголовок :name не должен существовать

# the-response-should-be-encoded-in
source: the response should be encoded in :encoding
ru: ответ должен быть закодирован :encoding

source: the response should expire in the future
ru: ответ должен истекать в будущем

source: print last response headers
ru: выведи заголовки последнего ответа

source: print the corresponding curl command
ru: выведи соответствующую команду curl

# the-columns-schema-of-the-table-should-match
source: the columns schema of the :table table should match:
ru: схема столбцов таблицы :table должна соответствовать:

# i-should-ess-n-columns-in-the-tables
source: (I )should see :count column(s) in the :table table
ru: (я )должен видеть :count столб(ец)(ца)(цов) в таблице :table

# i-should-see-n-rows-in-the-nth-tables
source: (I )should see :count rows in the :index :table table
ru: (я )должен видеть :count строк(у)(и) в :index таблице :table

# i-should-see-n-rows-in-the-tables
source: (I )should see :count row(s) in the :table table
ru: (я )должен видеть :count строк(у)(и) в таблице :table

# the-data-in-the-nth-row-of-the-table-should-match
source: the data in the :index row of the :table table should match:
ru: данные в(о) :index строке таблицы :table должны соответствовать:

# the-nth-column-of-the-nth-row-in-the-table-should-contain
source: the :colIndex column of the :rowIndex row in the :table table should contain :text
ru: :colIndex столбец :rowIndex строки в таблице :table должен содержать :text

source: (I )put a breakpoint
ru: (я )ставлю паузу

# i-save-a-screenshot-in
source: (I )save a screenshot in :filename
ru: я сохраняю скриншот в :filename

# the-xml-should-not-use-the-namespace
source: the XML should not use the namespace :namespace
ru: XML не должен использовать пространство им(е)(ё)н :namespace

# the-xml-should-use-the-namespace
source: the XML should use the namespace :namespace
ru: XML должен использовать пространство им(е)(ё)н :namespace

# the-xml-feed-should-be-valid-accoriding-to-its-dtd
source: the XML feed should be valid according to its DTD
ru: XML должен соответствовать его DTD

# the-xml-feed-should-be-valid-according-to-the-xsd
source: the XML feed should be valid according to the XSD :filename
ru: XML должен соответствовать XSD :filename

source: the XML feed should be valid according to this XSD:
ru: XML должен соответствовать следующему XSD:

# the-xml-feed-should-be-valid-according-to-the-relax-ng
source: the XML feed should be valid according to the relax NG schema :filename
ru: XML должен соответствовать relax NG схеме :filename

# the-xml-feed-should-be-valid-according-to-this-relax-ng
source: the XML feed should be valid according to this relax NG schema:
ru: XML должен соответствовать следующей relax NG схеме:

source: the atom feed should be valid
ru: atom должен быть валидным

source: the RSS2 feed should be valid
ru: RSS2 должен быть валидным

source: print last XML response
ru: выведи последний XML ответ

# the-xml-attribute-on-element-should-be-equal-to
source: the XML attribute :attribute on element :element should be equal to :text
ru: XML атрибут :attribute у элемента :element должен быть равен :text

# the-xml-attribute-on-element-should-not-be-equal-to
source: the XML attribute :attribute on element :element should not be equal to :text
ru: XML атрибут :attribute у элемента :element не должен быть равен :text

# the-xml-attribute-on-element-should-exists
source: the XML attribute :attribute on element :element should exist(s)
ru: XML атрибут :attribute у элемента :element должен существовать

# the-xml-attribute-on-element-should-not-exists
source: the XML attribute :attribute on element :element should not exist(s)
ru: XML атрибут :attribute у элемента :element не должен существовать

# the-xml-element-should-be-equal-to
source: the XML element :element should be equal to :text
ru: XML элемент :element должен быть равен :text

# the-xml-element-should-not-be-equal-to
source: the XML element :element should not be equal to :text
ru: XML элемент :element не должен быть равен :text

# the-xml-element-should-contain
source: the XML element :element should contain :text
ru: XML элемент :element должен содержать :text

# the-xml-element-should-not-contain
source: the XML element :element should not contain :text
ru: XML элемент :element не должен содержать :text

# the-xml-element-should-exists
source: the XML element :element should exist(s)
ru: XML элемент :element должен существовать

# the-xml-element-should-not-exists
source: the XML element :element should not exist(s)
ru: XML элемент :element не должен существовать

# the-xml-element-should-have-elements
source: the XML element :element should have :count element(s)
ru: XML элемент :element должен содержать :count элемент(а)(ов)

source: the response should be in XML
ru: ответ должен быть в XML

source: the response should not be in XML
ru: ответ не должен быть в XML
